<?php

return [
	/*
	 * --------------------------------------------------------------------------
	 * 后台设置
	 * --------------------------------------------------------------------------
	 *
	 * 其他设置项在config/admin.php
	 */

	// 版权声明
	'copyright' => 'Powered by <a href="https://www.zhuitech.com" target="_blank">追数科技</a>',

	/*
	 * --------------------------------------------------------------------------
	 * 安全设置
	 * --------------------------------------------------------------------------
	 *
	 */

	// 启用验证码登录
    'sms_login' => env('SMS_LOGIN', false),

	// 系统异常通知手机号
	'fault_notify_mobile' => '',

	/*
	 * --------------------------------------------------------------------------
	 * 性能设置
	 * --------------------------------------------------------------------------
	 *
	 */

	// CDN开启
	'cdn_status' => false,

	// CDN链接
	'cdn_url' => env('CDN_URL', ''),

	// 被替换域名
	'cdn_replace_url' => env('APP_URL', ''),

	// 并发请求用户数限制
	'concurrent_request_limit' => 0,
];
